{
  "backend/main.mo": "Motoko canister defining user profile storage keyed by Principal with access-controlled queries and updates using an authorization mixin and access control state.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence frontend changes to replace placeholder thumb SVG icons with exact user-uploaded SVG markup.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and recent changes of key frontend files, components, hooks, utilities, and configuration.",
  "frontend/index.css": "Global Tailwind CSS base defining a light-first monochrome design system via CSS variables, with dark theme variables retained but light theme applied by default.",
  "frontend/index.html": "HTML entry point for the frontend that mounts the React app, sets viewport metadata, and references a user-supplied favicon.",
  "frontend/public/.ic-assets.json5": "Internet Computer asset caching configuration specifying no-cache rules for generated thumb images and 24-hour caching for other assets.",
  "frontend/src/App.tsx": "Root React component that checks Internet Identity authentication state and conditionally renders a loading screen, onboarding flow, or the main Today page.",
  "frontend/src/components/icons/index.ts": "Barrel file exporting the ThumbsUpIcon and ThumbsDownIcon components for simplified imports.",
  "frontend/src/components/icons/ThumbsDownIcon.tsx": "React icon component that fetches and injects an external thumb-down SVG with className and currentColor support, falling back to an inline placeholder on error.",
  "frontend/src/components/icons/ThumbsUpIcon.tsx": "React icon component that fetches and injects an external thumb-up SVG with className and currentColor support, with a built-in placeholder fallback.",
  "frontend/src/components/JournalSlideOutPanel.tsx": "Slide-out panel component showing weekly summary, history list, and reset/logout actions, rendering outcomes with thumb icon components and normalized storage data.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches a backend actor based on Internet Identity state, initializes access control, and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines a React context, provider, and hook for managing Internet Identity authentication using Dfinity AuthClient, including login, logout, identity persistence, and login status flags.",
  "frontend/src/hooks/useRotatingPromiseSuggestions.ts": "Implements a React hook that cycles through predefined self-improvement suggestions with timed fade-in and fade-out visibility state.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining light-theme design tokens, base typography, and custom animation utilities used throughout the app.",
  "frontend/src/main.tsx": "Application entry point that initializes React, wraps the app with React Query and Internet Identity providers, and mounts it to the DOM.",
  "frontend/src/pages/Onboarding.tsx": "Onboarding screen with a carousel explaining the app concept and a call to authenticate via Internet Identity before entering the main app.",
  "frontend/src/pages/Today.tsx": "Main daily workflow page allowing users to set one promise, record a reflection outcome, view rotating suggestions, manage journal history, and log out.",
  "frontend/src/utils/journalHistoryStorage.ts": "LocalStorage utilities for creating, updating, repairing, and querying per-day journal entries and weekly history with optional reflection outcomes.",
  "frontend/src/utils/outcomeMapping.ts": "Centralized helpers for mapping thumbs-up/down UI selections to normalized positive/negative reflection outcomes and validating stored values.",
  "frontend/src/utils/todayPromiseStorage.ts": "Provides localStorage helpers to save, retrieve, and clear a single daily promise, keyed by calendar date. Automatically clears stale promises from previous days and wraps storage errors with handling.",
  "frontend/src/utils/todayReflectionStorage.ts": "Manages persistence of a daily reflection outcome in localStorage using a day key that resets at 06:00 instead of midnight. Includes helpers to save, retrieve, and clear reflections with rollover logic.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from query strings or hash routing and persisting them in sessionStorage. Supports retrieval precedence (URL over session), clearing session values, and sanitizing hash parameters.",
  "frontend/src/utils/weekUtils.ts": "Date utilities for computing Monday–Sunday week boundaries, stable per-day keys, and 06:00-reset day keys. Also includes helpers for week membership checks and human-readable date formatting.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining content paths, centered container settings, extended color system via CSS variables, fonts, radii, animations, and plugins (typography, container queries, animate).",
  "project_state.json": "Structured snapshot of the project's current state, including versioning, high-level summary, deadline context, and a catalog of implemented features with IDs, descriptions, and requirement mappings."
}