{
  "backend/main.mo": "Motoko canister that manages user profiles keyed by Principal, with query and update methods guarded by access-control permissions and admin checks.",
  "feature_evidence.json": "Feature evidence report describing a UI change on the Today page after saving a promise, including affected files, components, test IDs, and confidence level.",
  "frontend-file-summaries.txt": "JSON map providing high-level summaries of key frontend source files, pages, hooks, utilities, and styling configuration.",
  "frontend/index.css": "Global Tailwind CSS variables and base styles defining a monochrome theme, color tokens, layout defaults, and optional dark-mode overrides.",
  "frontend/index.html": "HTML entry point that sets metadata, favicon, root mount node, and loads the React application bundle.",
  "frontend/src/App.tsx": "Root React component that switches between onboarding, loading, and authenticated Today views based on Internet Identity session state.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches a backend actor via React Query, handling authenticated vs anonymous identities and initializing access control.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication context and provider for Internet Identity, managing login, logout, persisted identities, and detailed login status flags.",
  "frontend/src/hooks/useRotatingPromiseSuggestions.ts": "UI hook that cycles through predefined promise suggestions with timed fade-out and fade-in visibility transitions.",
  "frontend/src/index.css": "Global frontend styles importing Google fonts, configuring a light-only Tailwind theme, typography, and custom animation utilities.",
  "frontend/src/main.tsx": "React entry file that initializes the QueryClient, wraps the app with InternetIdentity and React Query providers, and mounts to the DOM.",
  "frontend/src/pages/Onboarding.tsx": "Onboarding screen that handles Internet Identity login and an optional animated carousel explaining the product before authentication.",
  "frontend/src/pages/Today.tsx": "Implements the Today page where a user creates a single daily promise, persists it locally, and then views a locked, non-editable state with reflection placeholders; also handles logout, error states, and rotating suggestion prompts.",
  "frontend/src/utils/todayPromiseStorage.ts": "Provides localStorage utilities to save, retrieve, validate-by-date, and clear the user's daily promise with basic error handling.",
  "frontend/src/utils/urlParams.ts": "Defines helpers for reading URL parameters from query strings or hash routing, persisting them in sessionStorage, and safely clearing them when needed.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining content paths, plugins, and an extended theme with custom colors, typography, animations, and layout tokens.",
  "project_state.json": "Tracks the high-level product description, implemented features, versions, and outstanding feature requests for the One Promise application."
}